---
kind: type
id: T:Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand

Enumerates all of the built-in commands which can be posted by an API application.

## Syntax (C#)
```csharp
public enum PostableCommand
```